---
type: BoundaryConditions
namespace: Autodesk.Revit.DB.Structure
version: 2024
members: 10
tags: [revit-api, class]
---

# BoundaryConditions

`Autodesk.Revit.DB.Structure.BoundaryConditions` · Revit 2024 · 10 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | GetBoundaryConditionsType | 2015 | `public BoundaryConditionsType GetBoundaryConditionsType ()` |
| Method | GetCurve | 2016 | `public Curve GetCurve ()` |
| Method | GetDegreesOfFreedomCoordinateSystem | 2015 | `public Transform GetDegreesOfFreedomCoordinateSystem ()` |
| Method | GetLoops | 2016 | `public IList < CurveLoop > GetLoops ()` |
| Method | GetOrientTo | 2015 | `public BoundaryConditionsOrientTo GetOrientTo ()` |
| Method | SetOrientTo | 2015 | `public void SetOrientTo ( BoundaryConditionsOrientTo orientTo )` |
| Property | AssociatedLoadId | 2016 | `public ElementId AssociatedLoadId { get ; set ; }` |
| Property | HostElementId | 2016 | `public ElementId HostElementId { get ; }` |
| Property | Parameter | — | `` |
| Property | Point | — | `public XYZ Point { get ; }` |